Repository: NMarjou/localization-app
Catalog: TMs/en-US_th-TH.tmx
Source language: en_us
Languages: th_th

source: No skills added yet. Upload your company's skills library to start tracking, developing, and optimizing your team's talents.
th_th: ยังไม่มีการเพิ่มทักษะ อัปโหลดไลบรารีทักษะของบริษัทเพื่อเริ่มติดตาม พัฒนา และเพิ่มประสิทธิภาพความสามารถของทีมของคุณ

source: Manage your company's skills
th_th: จัดการทักษะของบริษัทของคุณ

source: Expand all
th_th: ขยายทั้งหมด

source: Collapse all
th_th: ไม่แสดงทั้งหมด

source: Current manager
th_th: ผู้จัดการปัจจุบัน

source: You’re about to reassign the manager for this career development plan. The new manager will gain all permissions and actions currently available to the existing manager.
th_th: คุณกำลังจะเปลี่ยนผู้จัดการสำหรับแผนพัฒนาสายอาชีพฉบับนี้ ผู้จัดการคนใหม่จะได้รับสิทธิ์และการดำเนินการทั้งหมดที่มีให้กับผู้จัดการคนปัจจุบัน

source: New manager
th_th: ผู้จัดการคนใหม่

source: Search for a manager
th_th: ค้นหาผู้จัดการ

source: The new manager cannot be empty.
th_th: ผู้จัดการคนใหม่ต้องไม่เว้นว่าง

source: Reassign
th_th: มอบหมายใหม่

source: Reassign manager
th_th: มอบหมายผู้จัดการใหม่

source: This team member has no check-ins yet. Help start their journey by creating their first check-in.
th_th: สมาชิกทีมคนนี้ยังไม่มีการเช็กอิน เริ่มต้นการเดินทางของพวกเขาโดยสร้างการเช็กอินครั้งแรกให้กับพวกเขา

source: This team member has no goals yet. Create goals to help them progress.
th_th: สมาชิกทีมคนนี้ยังไม่มีเป้าหมาย กรุณาสร้างเป้าหมายเพื่อช่วยให้พวกเขาก้าวหน้า

source: Enhance this team member's profile by adding & rating skills
th_th: เพิ่มประสิทธิภาพโปรไฟล์ของสมาชิกทีมนี้โดยการเพิ่มและให้คะแนนทักษะ

source: Attached files
th_th: ไฟล์ที่แนบมา

source: Upload supporting files for the career development.
th_th: อัปโหลดไฟล์สนับสนุนสำหรับการพัฒนาอาชีพ

source: Preview goals in the career development page.
th_th: ดูตัวอย่างเป้าหมายในหน้าการพัฒนาอาชีพ

source: You don’t have the necessary permissions to manage goal plans.
th_th: คุณไม่มีสิทธิ์ที่จำเป็นในการจัดการแผนเป้าหมาย

source: Please contact your system administrator for assistance.
th_th: โปรดติดต่อผู้ดูแลระบบของคุณเพื่อขอความช่วยเหลือ

source: Select goal plan
th_th: เลือกแผนเป้าหมาย

source: Select goal type
th_th: เลือกประเภทเป้าหมาย

source: Go to the career plan questionnaire step to make changes.
th_th: ไปที่ขั้นตอนแบบสอบถามแผนอาชีพเพื่อทำการเปลี่ยนแปลง

source: All skills from the library
th_th: ทักษะทั้งหมดจากไลบรารี

source: Define the source for skills and competency scales.
th_th: กำหนดแหล่งที่มาสำหรับทักษะและระดับสมรรถนะ

source: Select skills & competency groups
th_th: เลือกกลุ่มทักษะและสมรรถนะ

source: Choose one option
th_th: เลือกหนึ่งตัวเลือก

source: Selected skills & competency groups
th_th: กลุ่มทักษะและความสามารถที่เลือก

source: Select competency scale
th_th: เลือกมาตราส่วนสมรรถนะ

source: Preview check-ins in the career development page.
th_th: ดูตัวอย่างการเช็คอินในหน้าความก้าวหน้าในสายอาชีพ

source: You must enable at least one widget to move to the next step.
th_th: คุณต้องเปิดใช้งานอย่างน้อยหนึ่งวิดเจ็ตเพื่อไปยังขั้นตอนถัดไป

source: Career plans
th_th: แผนอาชีพ

source: Participants
th_th: ผู้เข้าร่วม

source: Reflect on your achievements, challenges, and career aspirations. Taking a moment to think about your experiences will help you clearly articulate your development goals.
th_th: ไตร่ตรองถึงความสำเร็จ อุปสรรค และเป้าหมายในอาชีพของท่าน การใช้เวลาสักครู่เพื่อคิดทบทวนประสบการณ์ของท่านจะช่วยให้ท่านสามารถอธิบายเป้าหมายการพัฒนาของตนเองได้อย่างชัดเจน

source: Identify both your short- and long-term career goals. Be specific about what you want to accomplish and the skills you’d like to develop. This will ensure the plan aligns with your personal and professional growth.
th_th: ระบุเป้าหมายในอาชีพของท่านทั้งระยะสั้นและระยะยาว โปรดระบุให้ชัดเจนว่าท่านต้องการบรรลุอะไรและทักษะใดที่ท่านต้องการพัฒนา สิ่งนี้จะช่วยให้แผนสอดคล้องกับการเติบโตทั้งในด้านส่วนตัวและวิชาชีพของท่าน

source: Think about the training, projects, or responsibilities that can help you achieve your goals. In your plan, include opportunities that will support your growth and career advancement.
th_th: โปรดพิจารณาการฝึกอบรม โครงการ หรือความรับผิดชอบต่าง ๆ ที่จะช่วยให้ท่านบรรลุเป้าหมายของตนเอง ในแผนของท่าน กรุณาระบุโอกาสที่จะสนับสนุนการเติบโตและความก้าวหน้าในสายอาชีพของท่านด้วย

source: Break your goals down into actionable steps. Be sure to outline a timeline for achieving them and track your progress along the way.
th_th: แบ่งเป้าหมายของท่านออกเป็นขั้นตอนที่สามารถลงมือทำได้ อย่าลืมกำหนดระยะเวลาในการบรรลุเป้าหมายเหล่านั้น และติดตามความก้าวหน้าของท่านตลอดเส้นทาง

source: Create a supportive environment where workers feel comfortable sharing their aspirations, challenges, and goals. Listen actively and ask thoughtful questions to better understand their vision.
th_th: สร้างสภาพแวดล้อมที่สนับสนุนให้พนักงานรู้สึกสบายใจในการแบ่งปันความตั้งใจ ความท้าทาย และเป้าหมายของตนเอง รับฟังอย่างตั้งใจและตั้งคำถามเชิงลึกเพื่อให้เข้าใจวิสัยทัศน์ของพนักงานได้ดียิ่งขึ้น

source: Take time to review the worker's career development plan in detail. Provide constructive feedback, acknowledge their strengths, and highlight areas for growth.
th_th: โปรดสละเวลาในการทบทวนแผนพัฒนาสายอาชีพของพนักงานอย่างละเอียด ให้ข้อเสนอแนะที่สร้างสรรค์ ชื่นชมจุดแข็งของพวกเขา และชี้ให้เห็นจุดที่สามารถพัฒนาได้

source: Encourage your reports to explore new challenges and opportunities that help them grow while building on their current strengths and skills.
th_th: สนับสนุนให้ผู้ใต้บังคับบัญชาของท่านแสวงหาความท้าทายและโอกาสใหม่ ๆ ที่ช่วยให้พวกเขาเติบโต พร้อมกับต่อยอดจุดแข็งและทักษะที่มีอยู่ในปัจจุบัน

source: Share your own experiences and insights to inspire and guide workers. Be their advocate and actively support their growth journey.
th_th: แบ่งปันประสบการณ์และมุมมองของคุณเพื่อสร้างแรงบันดาลใจและเป็นแนวทางให้กับพนักงาน เป็นผู้สนับสนุนของพวกเขาและช่วยส่งเสริมการเติบโตในเส้นทางการทำงานอย่างแข็งขัน

source: Prepare in advance
th_th: เตรียมตัวล่วงหน้า

source: Define your goals
th_th: กำหนดเป้าหมายของคุณ

source: Explore development opportunities
th_th: สำรวจโอกาสในการพัฒนา

source: Set actionable steps
th_th: กำหนดขั้นตอนที่สามารถดำเนินการได้

source: Encourage open dialogue
th_th: ส่งเสริมการสนทนาอย่างเปิดเผย

source: Review the plan thoroughly
th_th: ตรวจสอบแผนอย่างละเอียด

source: Suggest opportunities for growth
th_th: แนะนำโอกาสในการเติบโต

source: Be a mentor, not just a manager
th_th: เป็นที่ปรึกษา ไม่ใช่แค่ผู้จัดการ

source: Here are some tips to guide you through filling out your career development plan:
th_th: นี่คือเคล็ดลับบางประการที่จะช่วยแนะนำท่านในการกรอกแผนพัฒนาสายอาชีพของท่าน:

source: Foster meaningful career development conversations!
th_th: ส่งเสริมการสนทนาเกี่ยวกับการพัฒนาอาชีพที่มีความหมาย!

source: Here are tips to effectively guide workers in their career development plans:
th_th: นี่คือเคล็ดลับในการแนะนำพนักงานอย่างมีประสิทธิภาพในการวางแผนพัฒนาสายอาชีพของตน:

source: Career plans that your team members own.
th_th: แผนอาชีพที่สมาชิกในทีมของท่านเป็นเจ้าของ

source: This worker currently has no career development plans
th_th: พนักงานคนนี้ยังไม่มีแผนพัฒนาสายอาชีพในขณะนี้

source: Are you sure you want to reassign this career development plan to the selected manager?
th_th: คุณแน่ใจหรือไม่ว่าต้องการมอบหมายแผนพัฒนาสายอาชีพนี้ให้กับผู้จัดการที่เลือกไว้

source: Confirm reassignment
th_th: ยืนยันการมอบหมายใหม่

source: The career development plan was successfully reassigned.
th_th: มีการเปลี่ยนผู้รับผิดชอบแผนพัฒนาสายอาชีพเรียบร้อยแล้ว

source: {{count}}/{{limit}} characters
th_th: {{count}}/{{limit}} อักขระ

source: The text exceeds the character limit.
th_th: ข้อความเกินจำนวนอักขระที่กำหนด

source: Once your manager submits their view on your performance, you will be invited to either accept and complete the check-in, or request to meet for further discussion.
th_th: เมื่อหัวหน้างานของคุณส่งมุมมองเกี่ยวกับผลการปฏิบัติงานของคุณแล้ว คุณจะได้รับคำเชิญให้ยอมรับและดำเนินการตรวจสอบ หรือขอพบเพื่อหารือเพิ่มเติม

source: Set date
th_th: กำหนดวันที่

source: Add discussion point
th_th: เพิ่มหัวข้อการสนทนา

source: Add recurrence
th_th: เพิ่มการเกิดซ้ำ

source: If yes, click the button and open the file once it has been downloaded to add this event to your calendar, and that of the other attendee.
th_th: หากใช่ ให้คลิกปุ่มและเปิดไฟล์หลังจากดาวน์โหลดเสร็จ เพื่อเพิ่มกิจกรรมนี้ลงในปฏิทินของคุณและของผู้เข้าร่วมคนอื่น

source: Download invite
th_th: ดาวน์โหลดคำเชิญ

source: Do you want to add this check-in to your calendar?
th_th: คุณต้องการเพิ่มการเช็คอินนี้ลงในปฏิทินของคุณหรือไม่

source: Make your check-ins more effective by adding key discussion points and agenda items every week. Reflect on the past week and plan for the next week to help increase productivity and ensure you and your manager are aligned on important deliverables.
th_th: ทำให้การเช็คอินของคุณมีประสิทธิผลมากขึ้นโดยเพิ่มประเด็นสำคัญในการสนทนาและหัวข้อวาระการประชุมทุกสัปดาห์ ไตร่ตรองถึงสัปดาห์ที่ผ่านมาและวางแผนสำหรับสัปดาห์หน้าเพื่อช่วยเพิ่มผลงานและให้แน่ใจว่าคุณและหัวหน้างานของคุณมีแนวทางเดียวกันในการส่งมอบที่สำคัญ

source: Have a great check-in conversation!
th_th: ขอให้สนุกกับการเช็คอิน!

source: Here are some tips to make the most of your check-ins.
th_th: ต่อไปนี้คือเคล็ดลับบางประการเพื่อให้คุณได้รับประโยชน์สูงสุดจากการเช็คอินของคุณ

source: Make sure you use your check-in time wisely. Coming prepared can greatly benefit the quality of the conversation and also impress your manager, as it demonstrates your focus on your goals and development.
th_th: อย่าลืมใช้เวลาเช็คอินอย่างชาญฉลาด การเตรียมตัวมาจะช่วยเพิ่มคุณภาพของการสนทนาได้เป็นอย่างดี และยังสร้างความประทับใจให้กับหัวหน้างานของคุณได้อีกด้วย เพราะนั่นแสดงให้เห็นว่าคุณให้ความสำคัญกับเป้าหมายและการพัฒนาของคุณ

source: The central focus of a check-in should be your current workload, and it should aim at ensuring that you and your manager are aligned on your projects and goals.
th_th: จุดสำคัญของการเช็คอินควรอยู่ที่ปริมาณงานปัจจุบันของคุณ และควรมีจุดมุ่งหมายเพื่อให้แน่ใจว่าคุณและหัวหน้างานของคุณมีความเห็นตรงกันเกี่ยวกับโครงการและเป้าหมายของคุณ

source: To prepare for your check-in, take some notes about the main items you have been working on that week and any key points you want to discuss. It only takes five minutes, but it can significantly improve the quality of your conversation.
th_th: ในการเตรียมตัวสำหรับการเช็คอิน ให้จดบันทึกเกี่ยวกับรายการหลักที่คุณทำในสัปดาห์นั้นและประเด็นสำคัญใดๆ ที่คุณต้องการพูดคุย ใช้เวลาเพียงห้านาที แต่สามารถปรับปรุงคุณภาพการสนทนาของคุณได้อย่างมาก

source: All participants
th_th: ผู้เข้าร่วมทุกคน

source: Assign check-in
th_th: กำหนดการเช็คอิน

source: Recognize behavior profile of:
th_th: จดจำโปรไฟล์พฤติกรรมของ:

source: Offer your team member insight into how you think they have progressed on their behaviors over this period.
th_th: เสนอข้อมูลเชิงลึกแก่สมาชิกในทีมของคุณว่าคุณคิดว่าพวกเขามีความคืบหน้าเกี่ยวกับพฤติกรรมอย่างไรในช่วงนี้

source: You have changed the type of the check-in. Please review the change with the check-in attendee.
th_th: คุณได้เปลี่ยนประเภทการเช็คอินแล้ว โปรดตรวจสอบการเปลี่ยนแปลงดังกล่าวกับผู้เข้าร่วมเช็คอิน

source: No messages yet
th_th: ยังไม่มีข้อความ

source: Why not start a conversation now?
th_th: เริ่มบทสนทนาได้เลยตอนนี้

source: Check-in chat
th_th: เช็คอินแชท

source: The check-in <u>{{title}} with {{name}}</u> was completed.
th_th: การเช็คอิน <u> {{title}} กับ {{name}} </u> เสร็จสมบูรณ์แล้ว

source: Your check-in was successfully created.
th_th: การเช็คอินของคุณถูกสร้างขึ้นสำเร็จแล้ว

source: {{numberOfCheckins}} check-ins with {{AssignedToUserName}} will be created.
th_th: ระบบจะสร้างการเช็คอิน {{numberOfCheckins}} กับ {{AssignedToUserName}}

source: You can create another check-in at any time.
th_th: คุณสามารถสร้างการเช็คอินอื่นได้ตลอดเวลา

source: {{count}} check-ins were successfully created.
th_th: สร้างการเช็คอิน {{count}} รายการสำเร็จแล้ว

source: The scheduled check-in <u>{{title}} with {{name}}</u> was canceled.
th_th: การเช็คอินตามกำหนดการ <u> {{title}} กับ {{name}} </u> ถูกยกเลิก

source: Your check-in was successfully saved.
th_th: การเช็คอินของคุณได้รับการบันทึกสำเร็จแล้ว

source: Focus factors for this check-in
th_th: ปัจจัยสำคัญในการเช็คอินนี้

source: Your check-in was successfully updated.
th_th: การเช็คอินของคุณได้รับการอัปเดตสำเร็จแล้ว

source: {{name}} will be notified that you have updated this check-in.
th_th: {{name}} จะได้รับการแจ้งเตือนว่าคุณได้อัปเดตการเช็คอินนี้แล้ว

source: Add point
th_th: เพิ่มหัวข้อการสนทนา

source: No discussion points for the moment
th_th: ไม่มีประเด็นการสนทนาสำหรับช่วงเวลานี้

source: Checklist
th_th: รายการตรวจสอบ

source: Are you sure you want to mark the check-in <strong>{{name}}</strong> as complete?
th_th: คุณแน่ใจหรือไม่ว่าต้องการทำเครื่องหมายการเช็คอิน <strong> {{name}} </strong> เป็นเสร็จสมบูรณ์

source: Complete check-in
th_th: การเช็คอินแบบสมบูรณ์

source: Select a date
th_th: เลือกวันที่

source: Are you sure you want to remove the check-in <strong>{{name}}</strong> from your check-in list?
th_th: คุณแน่ใจหรือไม่ว่าต้องการลบการเช็คอิน <strong> {{name}} </strong> จากรายการเช็คอินของคุณ

source: Delete check-in
th_th: ลบการเช็คอิน

source: Description and discussion points
th_th: คำอธิบายและหัวข้อการสนทนา

source: Check-ins created
th_th: สร้างการเช็คอินแล้ว

source: To help you prepare, include an overview of what you'd like to talk about here.
th_th: เพื่อช่วยคุณเตรียมตัว โปรดระบุภาพรวมของสิ่งที่คุณต้องการพูดคุยไว้ที่นี่

source: Add comment
th_th: เพิ่มความคิดเห็น

source: Discussion points
th_th: หัวข้อการสนทนา

source: Create some pointers to kick-start your check-in conversation.
th_th: สร้างคำแนะนำบางประการเพื่อเริ่มการสนทนาเช็คอินของคุณ

source: Edit check-in
th_th: แก้ไขการเช็คอิน

source: Edit discussion point
th_th: แก้ไขหัวข้อการสนทนา

source: Back to upcoming
th_th: ย้อนกลับไปยังรายการที่กำลังจะเกิดขึ้น

source: No check-ins have occurred that day.
th_th: วันนั้นไม่มีการเช็คอินเกิดขึ้น

source: No upcoming check-ins to be displayed. <br/>Schedule a new check-in.
th_th: ไม่มีการเช็คอินที่กำลังจะเกิดขึ้นที่จะแสดง <br/> กำหนดเวลาเช็คอินใหม่

source: No check-ins were recently updated.
th_th: ไม่มีการอัปเดตการเช็คอินเมื่อเร็ว ๆ นี้

source: No check-ins have taken place in the past.
th_th: ไม่มีการเช็คอินเกิดขึ้นในอดีต

source: Each worker to whom this check-in has been assigned can edit this section in their form.
th_th: พนักงานแต่ละคนที่ได้รับมอบหมายให้ทำการเช็คอินนี้สามารถแก้ไขส่วนนี้ในแบบฟอร์มของตนได้

source: Here are some helpful tips for understanding the different types of check-ins.
th_th: นี่คือเคล็ดลับที่เป็นประโยชน์สำหรับการทำความเข้าใจประเภทของการเช็คอินแต่ละแบบ

source: About check-ins
th_th: เกี่ยวกับการเช็คอิน

source: Occurs every two weeks on {{day}} effective {{startOn}} until {{endOn}}. In total, {{count}} number of check-ins will be created.
th_th: เกิดขึ้นทุก ๆ สองสัปดาห์ในวันที่ {{day}} มีผลตั้งแต่ {{startOn}} จนถึง {{endOn}} โดยรวมแล้วจะมีการสร้างการเช็คอินจำนวน {{count}} ครั้ง

source: Goal due date
th_th: วันครบกำหนดเป้าหมาย

source: Showing goals and deliverables of:
th_th: กำลังแสดงเป้าหมายและสิ่งที่ส่งมอบของ:

source: Goal priority
th_th: ลำดับความสำคัญของเป้าหมาย

source: Goal progress
th_th: ความคืบหน้าเป้าหมาย

source: Goal tracking status
th_th: สถานะการติดตามเป้าหมาย

source: Goal type: “{{typeName}}“
th_th: ประเภทเป้าหมาย: “ {{typeName}}“

source: Still in progress.
th_th: ยังอยู่ในระหว่างดำเนินการ

source: How was your check-in?
th_th: การเช็คอินของคุณเป็นอย่างไร

source: Are you sure you want to mark the check-in <strong>{{checkInTitle}}</strong> as completed?
th_th: คุณแน่ใจหรือไม่ว่าต้องการทำเครื่องหมายการเช็คอิน <strong> {{checkInTitle}} </strong> เป็นเสร็จสมบูรณ์

source: Marked as done by {{nickName}} {{name}}.
th_th: ถูกทำเครื่องหมายว่าเสร็จสิ้นโดย {{nickName}} {{name}}.

source: Assigned to
th_th: มอบหมายให้

source: {{count}} workers
th_th: พนักงาน {{count}} คน

source: {{count}} worker
th_th: พนักงาน {{count}} คน

source: {{count}} users
th_th: ผู้ใช้ {{count}} คน

source: Number of check-ins assigned to each selected worker and their line manager.
th_th: จำนวนการเช็คอินที่กำหนดให้กับพนักงานแต่ละคนที่เลือกและหัวหน้างานในสายงานของพวกเขา

source: Assigned to: {{count}}
th_th: มอบหมายให้: {{count}}

source: This assignment will create {{count}} check-ins between each worker and their line manager. Once the check-in is assigned, users will be able to edit its details and add a date.
th_th: งานนี้จะสร้างการเช็คอิน {{count}} ครั้งระหว่างพนักงานแต่ละคนกับหัวหน้างานในสายงาน เมื่อทำการเช็คอินแล้ว ผู้ใช้จะสามารถแก้ไขรายละเอียดและเพิ่มวันที่ได้

source: Get started by assigning one.
th_th: เริ่มต้นโดยการกำหนดหนึ่งรายการ

source: No check-ins mass assignments yet!
th_th: ยังไม่มีการมอบหมายเช็คอินแบบกลุ่มในขณะนี้!

source: Excluded individuals
th_th: บุคคลที่ถูกยกเว้น

source: Excluded workers: {{count}}
th_th: พนักงานที่ถูกแยกออก: {{count}}

source: Excluded
th_th: ยกเว้น

source: Included
th_th: รวม

source: No results match the search criteria. Clear the search to show all results.
th_th: ไม่มีผลลัพธ์ที่ตรงกับเกณฑ์การค้นหา ล้างการค้นหาเพื่อแสดงผลลัพธ์ทั้งหมด

source: Search for workers
th_th: ค้นหาพนักงาน

source: Performance check-ins require managers to provide their views on their team members' progress and performance.
th_th: การเช็คอินประสิทธิภาพจำเป็นต้องให้ผู้จัดการแสดงมุมมองเกี่ยวกับความก้าวหน้าและประสิทธิภาพการทำงานของสมาชิกในทีม

source: Regular check-ins enable managers and their team members to discuss day-to-day progress and any developmental focus.
th_th: การเช็คอินเป็นประจำช่วยให้พนักงานและสมาชิกในทีมสามารถหารือเกี่ยวกับความคืบหน้ารายวันและประเด็นเน้นการพัฒนาได้

source: See all participants
th_th: ดูผู้เข้าร่วมทั้งหมด

source: Monthly check-in
th_th: การเช็คอินประจำเดือน

source: Search for a worker or an organization
th_th: ค้นหาบุคลากรหรือหน่วยงาน

source: Occurs on day {{day}} of every month, effective {{startOn}} through {{endOn}}. In total, {{count}} check-ins will be created.
th_th: เกิดขึ้นในวันที่ {{day}} ของทุกเดือน มีผลตั้งแต่ {{startOn}} ถึง {{endOn}} โดยรวมแล้วจะมีการสร้างการเช็คอิน {{count}} ครั้ง

source: Specific date
th_th: วันที่ระบุ

source: Past
th_th: อดีต

source: Upcoming
th_th: กำลังจะเกิดขึ้น

source: Today
th_th: วันนี้

source: Assign check-ins
th_th: กำหนดการเช็คอิน

source: If you're assigning to multiple users, it might take a while for this list to appear in the check-in view.
th_th: หากคุณกำลังมอบหมายให้กับผู้ใช้หลายราย อาจต้องใช้เวลาสักครู่ก่อนที่รายการนี้จะปรากฏในมุมมองการเช็คอิน

source: The check-in was successfully assigned.
th_th: การเช็กอินได้รับมอบหมายเรียบร้อยแล้ว

source: This assignment will create {{count}} check-ins in total, between each selected worker and their line manager.
th_th: งานนี้จะสร้างการเช็คอินทั้งหมด {{count}} ครั้ง ระหว่างพนักงานที่เลือกแต่ละคนกับหัวหน้างานในสายงานของตน

source: Are you sure you want to assign this check-in?
th_th: คุณแน่ใจหรือไม่ว่าต้องการมอบหมายการเช็คอินนี้

source: No description added
th_th: ไม่มีคำอธิบายเพิ่มเติม

source: No discussion points added
th_th: ไม่มีประเด็นการสนทนาเพิ่ม

source: Overall performance
th_th: ผลการปฏิบัติงานโดยรวม

source: My overall performance
th_th: ประสิทธิภาพโดยรวมของฉัน

source: Offer your team member insight into how you think they have progressed on their overall performance over this period.
th_th: เสนอข้อมูลเชิงลึกแก่สมาชิกในทีมของคุณว่าคุณคิดว่าพวกเขามีความคืบหน้าในด้านประสิทธิภาพการทำงานโดยรวมอย่างไรในช่วงเวลานี้

source: Check-in with
th_th: เช็คอินด้วย

source: Pending manager submission
th_th: กำลังรอการส่งจากหัวหน้างาน

source: Allow managers to schedule dedicated conversations with direct reports to address performance-related topics.
th_th: การเช็คอินนี้ต้องให้หัวหน้างานแสดงมุมมองเกี่ยวกับความคืบหน้าของสมาชิกในทีมในช่วงเวลาดังกล่าว เมื่อหัวหน้างานส่งการเช็คอินแล้ว สมาชิกในทีมจะสามารถดูมุมมองของหัวหน้างานเกี่ยวกับประสิทธิภาพการทำงานของตนเองได้ และสามารถยอมรับและดำเนินการเช็คอินให้เสร็จสิ้น หรือตัดสินใจพบปะเพื่อหารือเพิ่มเติม

source: Offer your team member insights into how you think they have progressed on their behaviors this period.
th_th: เสนอข้อมูลเชิงลึกแก่สมาชิกในทีมของคุณว่าคุณเห็นว่าพวกเขามีความคืบหน้าเกี่ยวกับพฤติกรรมอย่างไรบ้างในช่วงนี้

source: Your comment
th_th: ความคิดเห็นของคุณ

source: Please share your thoughts in this section.
th_th: โปรดแบ่งปันความคิดของคุณในส่วนนี้

source: Gain insight into how your manager thinks you are progressing on your behaviors over this period.
th_th: รับข้อมูลเชิงลึกว่าหัวหน้างานของคุณคิดว่าคุณมีความคืบหน้าด้านพฤติกรรมอย่างไรในช่วงเวลานี้

source: Gain insight into how your manager thinks you are progressing on your goals over this period.
th_th: รับข้อมูลเชิงลึกว่าหัวหน้างานของคุณคิดว่าคุณมีความคืบหน้าในการบรรลุเป้าหมายของคุณในช่วงเวลานี้อย่างไร

source: Gain insight into how your manager thinks you are progressing on your overall performance over this period.
th_th: รับข้อมูลเชิงลึกว่าหัวหน้างานของคุณคิดว่าคุณมีความคืบหน้าในด้านประสิทธิภาพการทำงานโดยรวมอย่างไรในช่วงเวลานี้

source: Offer your team member insights into how you think they have progressed on their goals over this period.
th_th: เสนอข้อมูลเชิงลึกแก่สมาชิกในทีมของคุณเกี่ยวกับความคืบหน้าที่คุณคิดว่าพวกเขาได้บรรลุเป้าหมายในช่วงเวลานี้อย่างไร

source: This gives you insights into how your manager thinks you are progressing on your behaviors over this period.
th_th: สิ่งนี้ช่วยให้คุณเข้าใจว่าหัวหน้างานคิดว่าคุณมีความคืบหน้าด้านพฤติกรรมอย่างไรในช่วงเวลานี้

source: Offer your team member insights into how you think they have progressed on their overall performance over this period.
th_th: เสนอข้อมูลเชิงลึกแก่สมาชิกในทีมของคุณเกี่ยวกับความคืบหน้าของประสิทธิภาพการทำงานโดยรวมของพวกเขาในช่วงเวลานี้

source: Select rating
th_th: เลือกคะแนน

source: This user is inactive or your reporting relationship with them has changed. You can't create or update check-ins with them.
th_th: ผู้ใช้รายนี้ไม่ได้ใช้งานหรือความสัมพันธ์ในการรายงานของคุณกับผู้ใช้รายนี้มีการเปลี่ยนแปลง คุณไม่สามารถสร้างหรืออัปเดตการเช็คอินกับผู้ใช้รายนี้ได้

source: The end date must be later than the start date.
th_th: วันที่สิ้นสุดจะต้องอยู่หลังวันที่เริ่มต้น

source: Bi-weekly
th_th: ทุกสองสัปดาห์

source: Monthly
th_th: รายเดือน

source: Weekly
th_th: รายสัปดาห์

source: Repeat
th_th: ทำซ้ำ

source: Recurrence details
th_th: รายละเอียดการเกิดซ้ำ

source: Facilitate discussions between managers and team members about daily progress and areas for development.
th_th: ส่งเสริมการพูดคุยระหว่างผู้จัดการและสมาชิกทีมเกี่ยวกับความก้าวหน้าในแต่ละวันและประเด็นที่ควรพัฒนา

source: Action required
th_th: ต้องดำเนินการ

source: Action required — {{count}} item(s)
th_th: จำเป็นต้องดำเนินการ — {{count}} รายการ

source: To finish adding this check-in to your calendar, open the file once it has downloaded. If you need to change the date or time, you can do so directly from your calendar.
th_th: หากต้องการเพิ่มการเช็คอินนี้ลงในปฏิทินของคุณ ให้เปิดไฟล์เมื่อดาวน์โหลดเสร็จแล้ว หากคุณต้องการเปลี่ยนวันที่หรือเวลา คุณสามารถทำได้โดยตรงจากปฏิทินของคุณ

source: There are unsaved changes in the form. To submit this check-in, you must save all comments and/or ratings.
th_th: มีการเปลี่ยนแปลงที่ยังไม่ได้บันทึกในแบบฟอร์ม หากต้องการส่งการเช็คอินนี้ คุณต้องบันทึกความคิดเห็นและ/หรือการให้คะแนนทั้งหมด

source: Save to proceed
th_th: บันทึกเพื่อดำเนินการต่อ

source: Schedule check-in
th_th: กำหนดการเช็คอิน

source: Done
th_th: เสร็จสิ้น

source: Pending confirmation
th_th: รอการยืนยัน

source: Under review
th_th: อยู่ระหว่างการประเมินผลงาน

source: Are you sure you want to complete this check-in? Remember, you can create another check-in at anytime.
th_th: คุณแน่ใจหรือไม่ว่าต้องการทำการเช็คอินนี้ให้เสร็จสิ้นหรือไม่ โปรดจำไว้ว่าคุณสามารถสร้างการเช็คอินอีกครั้งเมื่อใดก็ได้

source: Open check-in
th_th: เปิดการเช็คอิน

source: Additional information
th_th: ข้อมูลเพิ่มเติม

source: Check-in
th_th: การเช็คอิน

source: My list
th_th: รายการของฉัน

source: Open {{name}} primary action
th_th: เปิดการดำเนินการหลักของ {{name}}
